In [1]:
import pandas as pd

In [2]:
nifty = pd.read_csv('nifty.csv')

In [3]:
data = pd.read_csv('data.csv')

In [13]:
nifty.tail()

            Date     Open     High      Low    Close
244  20 Jan 2022  8607.55  8621.10  8507.50  8552.40
245  19 Jan 2022  8670.00  8670.00  8572.30  8611.55
246  18 Jan 2022  8805.20  8813.25  8651.80  8666.35
247  17 Jan 2022  8755.20  8790.90  8747.95  8783.10
248  14 Jan 2022  8717.20  8766.75  8690.40  8753.40

In [14]:
#columns
nifty.columns

Index(['Date', 'Open', 'High', 'Low', 'Close'], dtype='object')

In [16]:
nifty.describe()

              Open        High          Low       Close
count   249.000000   249.00000   249.000000   249.00000
mean   8236.408635  8276.49759  8178.902209  8228.90502
std     417.435663   408.80345   421.545525   415.14246
min    7238.600000  7259.05000  7145.350000  7198.40000
25%    7886.350000  7948.95000  7842.550000  7892.05000
50%    8311.700000  8349.35000  8256.400000  8299.50000
75%    8558.350000  8590.95000  8510.250000  8552.40000
max    8929.900000  8930.90000  8892.300000  8909.90000

In [17]:
nifty.head(2)

          Date     Open    High      Low    Close
0  13 Jan 2023  8521.95  8562.7  8477.35  8549.50
1  12 Jan 2023  8541.05  8550.7  8470.40  8512.35

In [29]:
nifty.isnull().sum()

Date     0
Open     0
High     0
Low      0
Close    0
dtype: int64

In [30]:
print(f'the shape of nifty data is {nifty.shape}')

the shape of nifty data is (249, 5)

In [33]:
print(f'the shape of nifty data is {nifty.size}')

the shape of nifty data is 1245

In [39]:
nifty[['Date']].describe()

               Date
count           249
unique          249
top     13 Jan 2023
freq              1